zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/msp432p4xx/inc/msp432p4xx.h
typedef struct {
  __IO uint32_t CTL;                                                             /*!< LCD_F control */
  __IO uint32_t BMCTL;                                                           /*!< LCD_F blinking and memory control */
  __IO uint32_t VCTL;                                                            /*!< LCD_F voltage control */
  __IO uint32_t PCTL0;                                                           /*!< LCD_F port control 0 */
  __IO uint32_t PCTL1;                                                           /*!< LCD_F port control 1 */
  __IO uint32_t CSSEL0;                                                          /*!< LCD_F COM/SEG select register 0 */
  __IO uint32_t CSSEL1;                                                          /*!< LCD_F COM/SEG select register 1 */
  __IO uint32_t ANMCTL;                                                          /*!< LCD_F Animation Control Register */
       uint32_t RESERVED0[60];
  __IO uint32_t IE;                                                              /*!< LCD_F interrupt enable register */
  __I  uint32_t IFG;                                                             /*!< LCD_F interrupt flag register */
  __O  uint32_t SETIFG;                                                          /*!< LCD_F set interrupt flag register */
  __O  uint32_t CLRIFG;                                                          /*!< LCD_F clear interrupt flag register */
  __IO uint8_t M[48];                                                           /*!< LCD memory registers */
       uint8_t  RESERVED1[16];
  __IO uint8_t BM[48];                                                          /*!< LCD Blinking memory registers */
       uint8_t  RESERVED2[16];
  __IO uint8_t ANM[8];                                                          /*!< LCD Animation memory registers */
} LCD_F_Type;

typedef struct {
  __IO uint32_t CTL0;                                                            /*!< Control 0 Register */
  __IO uint32_t CTL1;                                                            /*!< Control 1 Register */
  __IO uint32_t IE;                                                              /*!< Interrupt Enable Register */
  __I  uint32_t IFG;                                                             /*!< Interrupt Flag Register */
  __O  uint32_t CLRIFG;                                                          /*!< Clear Interrupt Flag Register */
} PCM_Type;

typedef struct {
  __IO uint16_t KEYID;
  __IO uint16_t CTL;
} PMAP_COMMON_Type;

typedef struct {
  union {
    __IO uint16_t PMAP_REGISTER[4];
    struct {
      __IO uint8_t PMAP_REGISTER0;
      __IO uint8_t PMAP_REGISTER1;
      __IO uint8_t PMAP_REGISTER2;
      __IO uint8_t PMAP_REGISTER3;
      __IO uint8_t PMAP_REGISTER4;
      __IO uint8_t PMAP_REGISTER5;
      __IO uint8_t PMAP_REGISTER6;
      __IO uint8_t PMAP_REGISTER7;
    };
  };
} PMAP_REGISTER_Type;

typedef struct {
  __IO uint32_t KEY;                                                             /*!< Key Register */
  __IO uint32_t CTL0;                                                            /*!< Control 0 Register */
       uint32_t RESERVED0[11];
  __IO uint32_t IE;                                                              /*!< Interrupt Enable Register */
  __I  uint32_t IFG;                                                             /*!< Interrupt Flag Register */
  __IO uint32_t CLRIFG;                                                          /*!< Clear Interrupt Flag Register */
} PSS_Type;

typedef struct {
  __IO uint16_t CTL0;                                                            /*!< REF Control Register 0 */
} REF_A_Type;

typedef struct {
  __IO uint32_t RESET_REQ;                                                       /*!< Reset Request Register */
  __I  uint32_t HARDRESET_STAT;                                                  /*!< Hard Reset Status Register */
  __IO uint32_t HARDRESET_CLR;                                                   /*!< Hard Reset Status Clear Register */
  __IO uint32_t HARDRESET_SET;                                                   /*!< Hard Reset Status Set Register */
  __I  uint32_t SOFTRESET_STAT;                                                  /*!< Soft Reset Status Register */
  __IO uint32_t SOFTRESET_CLR;                                                   /*!< Soft Reset Status Clear Register */
  __IO uint32_t SOFTRESET_SET;                                                   /*!< Soft Reset Status Set Register */
       uint32_t RESERVED0[57];
  __I  uint32_t PSSRESET_STAT;                                                   /*!< PSS Reset Status Register */
  __IO uint32_t PSSRESET_CLR;                                                    /*!< PSS Reset Status Clear Register */
  __I  uint32_t PCMRESET_STAT;                                                   /*!< PCM Reset Status Register */
  __IO uint32_t PCMRESET_CLR;                                                    /*!< PCM Reset Status Clear Register */
  __I  uint32_t PINRESET_STAT;                                                   /*!< Pin Reset Status Register */
  __IO uint32_t PINRESET_CLR;                                                    /*!< Pin Reset Status Clear Register */
  __I  uint32_t REBOOTRESET_STAT;                                                /*!< Reboot Reset Status Register */
  __IO uint32_t REBOOTRESET_CLR;                                                 /*!< Reboot Reset Status Clear Register */
  __I  uint32_t CSRESET_STAT;                                                    /*!< CS Reset Status Register */
  __IO uint32_t CSRESET_CLR;                                                     /*!< CS Reset Status Clear Register */
} RSTCTL_Type;

typedef struct {
       uint16_t RESERVED0[8];
  __IO uint16_t TIM0;                                                            /*!< Real-Time Clock Seconds, Minutes Register - BCD Format */
  __IO uint16_t TIM1;                                                            /*!< Real-Time Clock Hour, Day of Week - BCD Format */
  __IO uint16_t DATE;                                                            /*!< Real-Time Clock Date - BCD Format */
  __IO uint16_t YEAR;                                                            /*!< Real-Time Clock Year Register - BCD Format */
  __IO uint16_t AMINHR;                                                          /*!< Real-Time Clock Minutes, Hour Alarm - BCD Format */
  __IO uint16_t ADOWDAY;                                                         /*!< Real-Time Clock Day of Week, Day of Month Alarm - BCD Format */
} RTC_C_BCD_Type;

