zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/msp432p4xx/inc/msp432p4xx.h
#define LCD_F_CTL_DIV_1                          ((uint32_t)0x00000800)          /*!< Divide by 2 */
#define LCD_F_CTL_DIV_2                          ((uint32_t)0x00001000)          /*!< Divide by 3 */
#define LCD_F_CTL_DIV_3                          ((uint32_t)0x00001800)          /*!< Divide by 4 */
#define LCD_F_CTL_DIV_4                          ((uint32_t)0x00002000)          /*!< Divide by 5 */
#define LCD_F_CTL_DIV_5                          ((uint32_t)0x00002800)          /*!< Divide by 6 */
#define LCD_F_CTL_DIV_6                          ((uint32_t)0x00003000)          /*!< Divide by 7 */
#define LCD_F_CTL_DIV_7                          ((uint32_t)0x00003800)          /*!< Divide by 8 */
#define LCD_F_CTL_DIV_8                          ((uint32_t)0x00004000)          /*!< Divide by 9 */
#define LCD_F_CTL_DIV_9                          ((uint32_t)0x00004800)          /*!< Divide by 10 */
#define LCD_F_CTL_DIV_10                         ((uint32_t)0x00005000)          /*!< Divide by 11 */
#define LCD_F_CTL_DIV_11                         ((uint32_t)0x00005800)          /*!< Divide by 12 */
#define LCD_F_CTL_DIV_12                         ((uint32_t)0x00006000)          /*!< Divide by 13 */
#define LCD_F_CTL_DIV_13                         ((uint32_t)0x00006800)          /*!< Divide by 14 */
#define LCD_F_CTL_DIV_14                         ((uint32_t)0x00007000)          /*!< Divide by 15 */
#define LCD_F_CTL_DIV_15                         ((uint32_t)0x00007800)          /*!< Divide by 16 */
#define LCD_F_CTL_DIV_16                         ((uint32_t)0x00008000)          /*!< Divide by 17 */
#define LCD_F_CTL_DIV_17                         ((uint32_t)0x00008800)          /*!< Divide by 18 */
#define LCD_F_CTL_DIV_18                         ((uint32_t)0x00009000)          /*!< Divide by 19 */
#define LCD_F_CTL_DIV_19                         ((uint32_t)0x00009800)          /*!< Divide by 20 */
#define LCD_F_CTL_DIV_20                         ((uint32_t)0x0000A000)          /*!< Divide by 21 */
#define LCD_F_CTL_DIV_21                         ((uint32_t)0x0000A800)          /*!< Divide by 22 */
#define LCD_F_CTL_DIV_22                         ((uint32_t)0x0000B000)          /*!< Divide by 23 */
#define LCD_F_CTL_DIV_23                         ((uint32_t)0x0000B800)          /*!< Divide by 24 */
#define LCD_F_CTL_DIV_24                         ((uint32_t)0x0000C000)          /*!< Divide by 25 */
#define LCD_F_CTL_DIV_25                         ((uint32_t)0x0000C800)          /*!< Divide by 26 */
#define LCD_F_CTL_DIV_26                         ((uint32_t)0x0000D000)          /*!< Divide by 27 */
#define LCD_F_CTL_DIV_27                         ((uint32_t)0x0000D800)          /*!< Divide by 28 */
#define LCD_F_CTL_DIV_28                         ((uint32_t)0x0000E000)          /*!< Divide by 29 */
#define LCD_F_CTL_DIV_29                         ((uint32_t)0x0000E800)          /*!< Divide by 30 */
#define LCD_F_CTL_DIV_30                         ((uint32_t)0x0000F000)          /*!< Divide by 31 */
#define LCD_F_CTL_DIV_31                         ((uint32_t)0x0000F800)          /*!< Divide by 32 */
#define LCD_F_CTL_SSEL_OFS                       (16)                            /*!< LCDSSEL Bit Offset */
#define LCD_F_CTL_SSEL_MASK                      ((uint32_t)0x00030000)          /*!< LCDSSEL Bit Mask */
#define LCD_F_CTL_SSEL0                          ((uint32_t)0x00010000)          /*!< SSEL Bit 0 */
#define LCD_F_CTL_SSEL1                          ((uint32_t)0x00020000)          /*!< SSEL Bit 1 */
#define LCD_F_CTL_SSEL_0                         ((uint32_t)0x00000000)          /*!< ACLK */
#define LCD_F_CTL_SSEL_1                         ((uint32_t)0x00010000)          /*!< VLOCLK */
#define LCD_F_CTL_SSEL_2                         ((uint32_t)0x00020000)          /*!< REFOCLK */
#define LCD_F_CTL_SSEL_3                         ((uint32_t)0x00030000)          /*!< LFXTCLK */
#define LCD_F_BMCTL_BLKMOD_OFS                   ( 0)                            /*!< LCDBLKMODx Bit Offset */
#define LCD_F_BMCTL_BLKMOD_MASK                  ((uint32_t)0x00000003)          /*!< LCDBLKMODx Bit Mask */
#define LCD_F_BMCTL_BLKMOD0                      ((uint32_t)0x00000001)          /*!< BLKMOD Bit 0 */
#define LCD_F_BMCTL_BLKMOD1                      ((uint32_t)0x00000002)          /*!< BLKMOD Bit 1 */
#define LCD_F_BMCTL_BLKMOD_0                     ((uint32_t)0x00000000)          /*!< Blinking disabled */
#define LCD_F_BMCTL_BLKMOD_1                     ((uint32_t)0x00000001)          /*!< Blinking of individual segments as enabled in blinking memory register  */
#define LCD_F_BMCTL_BLKMOD_2                     ((uint32_t)0x00000002)          /*!< Blinking of all segments */
#define LCD_F_BMCTL_BLKMOD_3                     ((uint32_t)0x00000003)          /*!< Switching between display contents as stored in LCDMx and LCDBMx memory  */
#define LCD_F_BMCTL_BLKPRE_OFS                   ( 2)                            /*!< LCDBLKPREx Bit Offset */
#define LCD_F_BMCTL_BLKPRE_MASK                  ((uint32_t)0x0000001C)          /*!< LCDBLKPREx Bit Mask */
#define LCD_F_BMCTL_BLKPRE0                      ((uint32_t)0x00000004)          /*!< BLKPRE Bit 0 */
#define LCD_F_BMCTL_BLKPRE1                      ((uint32_t)0x00000008)          /*!< BLKPRE Bit 1 */
#define LCD_F_BMCTL_BLKPRE2                      ((uint32_t)0x00000010)          /*!< BLKPRE Bit 2 */
#define LCD_F_BMCTL_BLKPRE_0                     ((uint32_t)0x00000000)          /*!< Divide by 512 */
#define LCD_F_BMCTL_BLKPRE_1                     ((uint32_t)0x00000004)          /*!< Divide by 1024 */
#define LCD_F_BMCTL_BLKPRE_2                     ((uint32_t)0x00000008)          /*!< Divide by 2048 */
#define LCD_F_BMCTL_BLKPRE_3                     ((uint32_t)0x0000000C)          /*!< Divide by 4096 */
#define LCD_F_BMCTL_BLKPRE_4                     ((uint32_t)0x00000010)          /*!< Divide by 8162 */
#define LCD_F_BMCTL_BLKPRE_5                     ((uint32_t)0x00000014)          /*!< Divide by 16384 */
#define LCD_F_BMCTL_BLKPRE_6                     ((uint32_t)0x00000018)          /*!< Divide by 32768 */
#define LCD_F_BMCTL_BLKPRE_7                     ((uint32_t)0x0000001C)          /*!< Divide by 65536 */
#define LCD_F_BMCTL_BLKDIV_OFS                   ( 5)                            /*!< LCDBLKDIVx Bit Offset */
#define LCD_F_BMCTL_BLKDIV_MASK                  ((uint32_t)0x000000E0)          /*!< LCDBLKDIVx Bit Mask */
#define LCD_F_BMCTL_BLKDIV0                      ((uint32_t)0x00000020)          /*!< BLKDIV Bit 0 */
#define LCD_F_BMCTL_BLKDIV1                      ((uint32_t)0x00000040)          /*!< BLKDIV Bit 1 */
#define LCD_F_BMCTL_BLKDIV2                      ((uint32_t)0x00000080)          /*!< BLKDIV Bit 2 */
#define LCD_F_BMCTL_BLKDIV_0                     ((uint32_t)0x00000000)          /*!< Divide by 1 */
#define LCD_F_BMCTL_BLKDIV_1                     ((uint32_t)0x00000020)          /*!< Divide by 2 */
#define LCD_F_BMCTL_BLKDIV_2                     ((uint32_t)0x00000040)          /*!< Divide by 3 */
#define LCD_F_BMCTL_BLKDIV_3                     ((uint32_t)0x00000060)          /*!< Divide by 4 */
#define LCD_F_BMCTL_BLKDIV_4                     ((uint32_t)0x00000080)          /*!< Divide by 5 */
#define LCD_F_BMCTL_BLKDIV_5                     ((uint32_t)0x000000A0)          /*!< Divide by 6 */
#define LCD_F_BMCTL_BLKDIV_6                     ((uint32_t)0x000000C0)          /*!< Divide by 7 */
#define LCD_F_BMCTL_BLKDIV_7                     ((uint32_t)0x000000E0)          /*!< Divide by 8 */
#define LCD_F_BMCTL_DISP_OFS                     (16)                            /*!< LCDDISP Bit Offset */
#define LCD_F_BMCTL_DISP                         ((uint32_t)0x00010000)          /*!< Select LCD memory registers for display */
#define LCD_F_BMCTL_CLRM_OFS                     (17)                            /*!< LCDCLRM Bit Offset */
#define LCD_F_BMCTL_CLRM                         ((uint32_t)0x00020000)          /*!< Clear LCD memory */
#define LCD_F_BMCTL_CLRBM_OFS                    (18)                            /*!< LCDCLRBM Bit Offset */
#define LCD_F_BMCTL_CLRBM                        ((uint32_t)0x00040000)          /*!< Clear LCD blinking memory */
#define LCD_F_VCTL_LCD2B_OFS                     ( 0)                            /*!< LCD2B Bit Offset */
#define LCD_F_VCTL_LCD2B                         ((uint32_t)0x00000001)          /*!< Bias select. */
#define LCD_F_VCTL_EXTBIAS_OFS                   ( 5)                            /*!< LCDEXTBIAS Bit Offset */
#define LCD_F_VCTL_EXTBIAS                       ((uint32_t)0x00000020)          /*!< V2 to V4 voltage select */
#define LCD_F_VCTL_R03EXT_OFS                    ( 6)                            /*!< R03EXT Bit Offset */
#define LCD_F_VCTL_R03EXT                        ((uint32_t)0x00000040)          /*!< V5 voltage select */
#define LCD_F_VCTL_REXT_OFS                      ( 7)                            /*!< LCDREXT Bit Offset */
#define LCD_F_VCTL_REXT                          ((uint32_t)0x00000080)          /*!< V2 to V4 voltage on external Rx3 pins */
#define LCD_F_PCTL0_S0_OFS                       ( 0)                            /*!< LCDS0 Bit Offset */
#define LCD_F_PCTL0_S0                           ((uint32_t)0x00000001)          /*!< LCD pin 0 enable */
#define LCD_F_PCTL0_S1_OFS                       ( 1)                            /*!< LCDS1 Bit Offset */
#define LCD_F_PCTL0_S1                           ((uint32_t)0x00000002)          /*!< LCD pin 1 enable */
#define LCD_F_PCTL0_S2_OFS                       ( 2)                            /*!< LCDS2 Bit Offset */
#define LCD_F_PCTL0_S2                           ((uint32_t)0x00000004)          /*!< LCD pin 2 enable */
#define LCD_F_PCTL0_S3_OFS                       ( 3)                            /*!< LCDS3 Bit Offset */
#define LCD_F_PCTL0_S3                           ((uint32_t)0x00000008)          /*!< LCD pin 3 enable */
#define LCD_F_PCTL0_S4_OFS                       ( 4)                            /*!< LCDS4 Bit Offset */
#define LCD_F_PCTL0_S4                           ((uint32_t)0x00000010)          /*!< LCD pin 4 enable */
#define LCD_F_PCTL0_S5_OFS                       ( 5)                            /*!< LCDS5 Bit Offset */
#define LCD_F_PCTL0_S5                           ((uint32_t)0x00000020)          /*!< LCD pin 5 enable */
#define LCD_F_PCTL0_S6_OFS                       ( 6)                            /*!< LCDS6 Bit Offset */
#define LCD_F_PCTL0_S6                           ((uint32_t)0x00000040)          /*!< LCD pin 6 enable */
#define LCD_F_PCTL0_S7_OFS                       ( 7)                            /*!< LCDS7 Bit Offset */
#define LCD_F_PCTL0_S7                           ((uint32_t)0x00000080)          /*!< LCD pin 7 enable */
#define LCD_F_PCTL0_S8_OFS                       ( 8)                            /*!< LCDS8 Bit Offset */
#define LCD_F_PCTL0_S8                           ((uint32_t)0x00000100)          /*!< LCD pin 8 enable */
#define LCD_F_PCTL0_S9_OFS                       ( 9)                            /*!< LCDS9 Bit Offset */
#define LCD_F_PCTL0_S9                           ((uint32_t)0x00000200)          /*!< LCD pin 9 enable */
#define LCD_F_PCTL0_S10_OFS                      (10)                            /*!< LCDS10 Bit Offset */
#define LCD_F_PCTL0_S10                          ((uint32_t)0x00000400)          /*!< LCD pin 10 enable */
#define LCD_F_PCTL0_S11_OFS                      (11)                            /*!< LCDS11 Bit Offset */
#define LCD_F_PCTL0_S11                          ((uint32_t)0x00000800)          /*!< LCD pin 11 enable */
#define LCD_F_PCTL0_S12_OFS                      (12)                            /*!< LCDS12 Bit Offset */
#define LCD_F_PCTL0_S12                          ((uint32_t)0x00001000)          /*!< LCD pin 12 enable */
#define LCD_F_PCTL0_S13_OFS                      (13)                            /*!< LCDS13 Bit Offset */
#define LCD_F_PCTL0_S13                          ((uint32_t)0x00002000)          /*!< LCD pin 13 enable */
#define LCD_F_PCTL0_S14_OFS                      (14)                            /*!< LCDS14 Bit Offset */
#define LCD_F_PCTL0_S14                          ((uint32_t)0x00004000)          /*!< LCD pin 14 enable */
#define LCD_F_PCTL0_S15_OFS                      (15)                            /*!< LCDS15 Bit Offset */
#define LCD_F_PCTL0_S15                          ((uint32_t)0x00008000)          /*!< LCD pin 15 enable */
#define LCD_F_PCTL0_S16_OFS                      (16)                            /*!< LCDS16 Bit Offset */
#define LCD_F_PCTL0_S16                          ((uint32_t)0x00010000)          /*!< LCD pin 16 enable */
#define LCD_F_PCTL0_S17_OFS                      (17)                            /*!< LCDS17 Bit Offset */
#define LCD_F_PCTL0_S17                          ((uint32_t)0x00020000)          /*!< LCD pin 17 enable */
#define LCD_F_PCTL0_S18_OFS                      (18)                            /*!< LCDS18 Bit Offset */
#define LCD_F_PCTL0_S18                          ((uint32_t)0x00040000)          /*!< LCD pin 18 enable */
#define LCD_F_PCTL0_S19_OFS                      (19)                            /*!< LCDS19 Bit Offset */
#define LCD_F_PCTL0_S19                          ((uint32_t)0x00080000)          /*!< LCD pin 19 enable */
#define LCD_F_PCTL0_S20_OFS                      (20)                            /*!< LCDS20 Bit Offset */
#define LCD_F_PCTL0_S20                          ((uint32_t)0x00100000)          /*!< LCD pin 20 enable */
#define LCD_F_PCTL0_S21_OFS                      (21)                            /*!< LCDS21 Bit Offset */
#define LCD_F_PCTL0_S21                          ((uint32_t)0x00200000)          /*!< LCD pin 21 enable */
#define LCD_F_PCTL0_S22_OFS                      (22)                            /*!< LCDS22 Bit Offset */
#define LCD_F_PCTL0_S22                          ((uint32_t)0x00400000)          /*!< LCD pin 22 enable */
#define LCD_F_PCTL0_S23_OFS                      (23)                            /*!< LCDS23 Bit Offset */
#define LCD_F_PCTL0_S23                          ((uint32_t)0x00800000)          /*!< LCD pin 23 enable */
#define LCD_F_PCTL0_S24_OFS                      (24)                            /*!< LCDS24 Bit Offset */
#define LCD_F_PCTL0_S24                          ((uint32_t)0x01000000)          /*!< LCD pin 24 enable */
#define LCD_F_PCTL0_S25_OFS                      (25)                            /*!< LCDS25 Bit Offset */
#define LCD_F_PCTL0_S25                          ((uint32_t)0x02000000)          /*!< LCD pin 25 enable */
#define LCD_F_PCTL0_S26_OFS                      (26)                            /*!< LCDS26 Bit Offset */
#define LCD_F_PCTL0_S26                          ((uint32_t)0x04000000)          /*!< LCD pin 26 enable */
#define LCD_F_PCTL0_S27_OFS                      (27)                            /*!< LCDS27 Bit Offset */
#define LCD_F_PCTL0_S27                          ((uint32_t)0x08000000)          /*!< LCD pin 27 enable */
#define LCD_F_PCTL0_S28_OFS                      (28)                            /*!< LCDS28 Bit Offset */
#define LCD_F_PCTL0_S28                          ((uint32_t)0x10000000)          /*!< LCD pin 28 enable */
#define LCD_F_PCTL0_S29_OFS                      (29)                            /*!< LCDS29 Bit Offset */
#define LCD_F_PCTL0_S29                          ((uint32_t)0x20000000)          /*!< LCD pin 29 enable */
#define LCD_F_PCTL0_S30_OFS                      (30)                            /*!< LCDS30 Bit Offset */
#define LCD_F_PCTL0_S30                          ((uint32_t)0x40000000)          /*!< LCD pin 30 enable */
#define LCD_F_PCTL0_S31_OFS                      (31)                            /*!< LCDS31 Bit Offset */
#define LCD_F_PCTL0_S31                          ((uint32_t)0x80000000)          /*!< LCD pin 31 enable */
#define LCD_F_PCTL1_S32_OFS                      ( 0)                            /*!< LCDS32 Bit Offset */
#define LCD_F_PCTL1_S32                          ((uint32_t)0x00000001)          /*!< LCD pin 32 enable */
#define LCD_F_PCTL1_S33_OFS                      ( 1)                            /*!< LCDS33 Bit Offset */
#define LCD_F_PCTL1_S33                          ((uint32_t)0x00000002)          /*!< LCD pin 33 enable */
#define LCD_F_PCTL1_S34_OFS                      ( 2)                            /*!< LCDS34 Bit Offset */
#define LCD_F_PCTL1_S34                          ((uint32_t)0x00000004)          /*!< LCD pin 34 enable */
#define LCD_F_PCTL1_S35_OFS                      ( 3)                            /*!< LCDS35 Bit Offset */
#define LCD_F_PCTL1_S35                          ((uint32_t)0x00000008)          /*!< LCD pin 35 enable */
#define LCD_F_PCTL1_S36_OFS                      ( 4)                            /*!< LCDS36 Bit Offset */
#define LCD_F_PCTL1_S36                          ((uint32_t)0x00000010)          /*!< LCD pin 36 enable */
#define LCD_F_PCTL1_S37_OFS                      ( 5)                            /*!< LCDS37 Bit Offset */
#define LCD_F_PCTL1_S37                          ((uint32_t)0x00000020)          /*!< LCD pin 37 enable */
#define LCD_F_PCTL1_S38_OFS                      ( 6)                            /*!< LCDS38 Bit Offset */
#define LCD_F_PCTL1_S38                          ((uint32_t)0x00000040)          /*!< LCD pin 38 enable */
#define LCD_F_PCTL1_S39_OFS                      ( 7)                            /*!< LCDS39 Bit Offset */
#define LCD_F_PCTL1_S39                          ((uint32_t)0x00000080)          /*!< LCD pin 39 enable */
#define LCD_F_PCTL1_S40_OFS                      ( 8)                            /*!< LCDS40 Bit Offset */
#define LCD_F_PCTL1_S40                          ((uint32_t)0x00000100)          /*!< LCD pin 40 enable */
#define LCD_F_PCTL1_S41_OFS                      ( 9)                            /*!< LCDS41 Bit Offset */
#define LCD_F_PCTL1_S41                          ((uint32_t)0x00000200)          /*!< LCD pin 41 enable */
#define LCD_F_PCTL1_S42_OFS                      (10)                            /*!< LCDS42 Bit Offset */
#define LCD_F_PCTL1_S42                          ((uint32_t)0x00000400)          /*!< LCD pin 42 enable */
#define LCD_F_PCTL1_S43_OFS                      (11)                            /*!< LCDS43 Bit Offset */
#define LCD_F_PCTL1_S43                          ((uint32_t)0x00000800)          /*!< LCD pin 43 enable */
#define LCD_F_PCTL1_S44_OFS                      (12)                            /*!< LCDS44 Bit Offset */
#define LCD_F_PCTL1_S44                          ((uint32_t)0x00001000)          /*!< LCD pin 44 enable */
#define LCD_F_PCTL1_S45_OFS                      (13)                            /*!< LCDS45 Bit Offset */
#define LCD_F_PCTL1_S45                          ((uint32_t)0x00002000)          /*!< LCD pin 45 enable */
#define LCD_F_PCTL1_S46_OFS                      (14)                            /*!< LCDS46 Bit Offset */
#define LCD_F_PCTL1_S46                          ((uint32_t)0x00004000)          /*!< LCD pin 46 enable */
#define LCD_F_PCTL1_S47_OFS                      (15)                            /*!< LCDS47 Bit Offset */
#define LCD_F_PCTL1_S47                          ((uint32_t)0x00008000)          /*!< LCD pin 47 enable */
#define LCD_F_PCTL1_S48_OFS                      (16)                            /*!< LCDS48 Bit Offset */
#define LCD_F_PCTL1_S48                          ((uint32_t)0x00010000)          /*!< LCD pin 48 enable */
#define LCD_F_PCTL1_S49_OFS                      (17)                            /*!< LCDS49 Bit Offset */
#define LCD_F_PCTL1_S49                          ((uint32_t)0x00020000)          /*!< LCD pin 49 enable */
#define LCD_F_PCTL1_S50_OFS                      (18)                            /*!< LCDS50 Bit Offset */
#define LCD_F_PCTL1_S50                          ((uint32_t)0x00040000)          /*!< LCD pin 50 enable */
#define LCD_F_PCTL1_S51_OFS                      (19)                            /*!< LCDS51 Bit Offset */
#define LCD_F_PCTL1_S51                          ((uint32_t)0x00080000)          /*!< LCD pin 51 enable */
#define LCD_F_PCTL1_S52_OFS                      (20)                            /*!< LCDS52 Bit Offset */
#define LCD_F_PCTL1_S52                          ((uint32_t)0x00100000)          /*!< LCD pin 52 enable */
#define LCD_F_PCTL1_S53_OFS                      (21)                            /*!< LCDS53 Bit Offset */
#define LCD_F_PCTL1_S53                          ((uint32_t)0x00200000)          /*!< LCD pin 53 enable */
#define LCD_F_PCTL1_S54_OFS                      (22)                            /*!< LCDS54 Bit Offset */
#define LCD_F_PCTL1_S54                          ((uint32_t)0x00400000)          /*!< LCD pin 54 enable */
#define LCD_F_PCTL1_S55_OFS                      (23)                            /*!< LCDS55 Bit Offset */
#define LCD_F_PCTL1_S55                          ((uint32_t)0x00800000)          /*!< LCD pin 55 enable */
#define LCD_F_PCTL1_S56_OFS                      (24)                            /*!< LCDS56 Bit Offset */
#define LCD_F_PCTL1_S56                          ((uint32_t)0x01000000)          /*!< LCD pin 56 enable */
#define LCD_F_PCTL1_S57_OFS                      (25)                            /*!< LCDS57 Bit Offset */
#define LCD_F_PCTL1_S57                          ((uint32_t)0x02000000)          /*!< LCD pin 57 enable */
#define LCD_F_PCTL1_S58_OFS                      (26)                            /*!< LCDS58 Bit Offset */
#define LCD_F_PCTL1_S58                          ((uint32_t)0x04000000)          /*!< LCD pin 58 enable */
#define LCD_F_PCTL1_S59_OFS                      (27)                            /*!< LCDS59 Bit Offset */
#define LCD_F_PCTL1_S59                          ((uint32_t)0x08000000)          /*!< LCD pin 59 enable */
#define LCD_F_PCTL1_S60_OFS                      (28)                            /*!< LCDS60 Bit Offset */
#define LCD_F_PCTL1_S60                          ((uint32_t)0x10000000)          /*!< LCD pin 60 enable */
#define LCD_F_PCTL1_S61_OFS                      (29)                            /*!< LCDS61 Bit Offset */
#define LCD_F_PCTL1_S61                          ((uint32_t)0x20000000)          /*!< LCD pin 61 enable */
#define LCD_F_PCTL1_S62_OFS                      (30)                            /*!< LCDS62 Bit Offset */
#define LCD_F_PCTL1_S62                          ((uint32_t)0x40000000)          /*!< LCD pin 62 enable */
#define LCD_F_PCTL1_S63_OFS                      (31)                            /*!< LCDS63 Bit Offset */
#define LCD_F_PCTL1_S63                          ((uint32_t)0x80000000)          /*!< LCD pin 63 enable */
#define LCD_F_CSSEL0_CSS0_OFS                    ( 0)                            /*!< LCDCSS0 Bit Offset */
#define LCD_F_CSSEL0_CSS0                        ((uint32_t)0x00000001)          /*!< L0 Com Seg select */
#define LCD_F_CSSEL0_CSS1_OFS                    ( 1)                            /*!< LCDCSS1 Bit Offset */
#define LCD_F_CSSEL0_CSS1                        ((uint32_t)0x00000002)          /*!< L1 Com Seg select */
#define LCD_F_CSSEL0_CSS2_OFS                    ( 2)                            /*!< LCDCSS2 Bit Offset */
#define LCD_F_CSSEL0_CSS2                        ((uint32_t)0x00000004)          /*!< L2 Com Seg select */
#define LCD_F_CSSEL0_CSS3_OFS                    ( 3)                            /*!< LCDCSS3 Bit Offset */
#define LCD_F_CSSEL0_CSS3                        ((uint32_t)0x00000008)          /*!< L3 Com Seg select */
#define LCD_F_CSSEL0_CSS4_OFS                    ( 4)                            /*!< LCDCSS4 Bit Offset */
#define LCD_F_CSSEL0_CSS4                        ((uint32_t)0x00000010)          /*!< L4 Com Seg select */
