zephyrproject-rtos/zephyr/ext/hal/ti/simplelink/source/ti/devices/msp432p4xx/inc/msp432p4xx.h
#define LCD_F_CSSEL0_CSS5_OFS                    ( 5)                            /*!< LCDCSS5 Bit Offset */
#define LCD_F_CSSEL0_CSS5                        ((uint32_t)0x00000020)          /*!< L5 Com Seg select */
#define LCD_F_CSSEL0_CSS6_OFS                    ( 6)                            /*!< LCDCSS6 Bit Offset */
#define LCD_F_CSSEL0_CSS6                        ((uint32_t)0x00000040)          /*!< L6 Com Seg select */
#define LCD_F_CSSEL0_CSS7_OFS                    ( 7)                            /*!< LCDCSS7 Bit Offset */
#define LCD_F_CSSEL0_CSS7                        ((uint32_t)0x00000080)          /*!< L7 Com Seg select */
#define LCD_F_CSSEL0_CSS8_OFS                    ( 8)                            /*!< LCDCSS8 Bit Offset */
#define LCD_F_CSSEL0_CSS8                        ((uint32_t)0x00000100)          /*!< L8 Com Seg select */
#define LCD_F_CSSEL0_CSS9_OFS                    ( 9)                            /*!< LCDCSS9 Bit Offset */
#define LCD_F_CSSEL0_CSS9                        ((uint32_t)0x00000200)          /*!< L9 Com Seg select */
#define LCD_F_CSSEL0_CSS10_OFS                   (10)                            /*!< LCDCSS10 Bit Offset */
#define LCD_F_CSSEL0_CSS10                       ((uint32_t)0x00000400)          /*!< L10 Com Seg select */
#define LCD_F_CSSEL0_CSS11_OFS                   (11)                            /*!< LCDCSS11 Bit Offset */
#define LCD_F_CSSEL0_CSS11                       ((uint32_t)0x00000800)          /*!< L11 Com Seg select */
#define LCD_F_CSSEL0_CSS12_OFS                   (12)                            /*!< LCDCSS12 Bit Offset */
#define LCD_F_CSSEL0_CSS12                       ((uint32_t)0x00001000)          /*!< L12 Com Seg select */
#define LCD_F_CSSEL0_CSS13_OFS                   (13)                            /*!< LCDCSS13 Bit Offset */
#define LCD_F_CSSEL0_CSS13                       ((uint32_t)0x00002000)          /*!< L13 Com Seg select */
#define LCD_F_CSSEL0_CSS14_OFS                   (14)                            /*!< LCDCSS14 Bit Offset */
#define LCD_F_CSSEL0_CSS14                       ((uint32_t)0x00004000)          /*!< L14 Com Seg select */
#define LCD_F_CSSEL0_CSS15_OFS                   (15)                            /*!< LCDCSS15 Bit Offset */
#define LCD_F_CSSEL0_CSS15                       ((uint32_t)0x00008000)          /*!< L15 Com Seg select */
#define LCD_F_CSSEL0_CSS16_OFS                   (16)                            /*!< LCDCSS16 Bit Offset */
#define LCD_F_CSSEL0_CSS16                       ((uint32_t)0x00010000)          /*!< L16 Com Seg select */
#define LCD_F_CSSEL0_CSS17_OFS                   (17)                            /*!< LCDCSS17 Bit Offset */
#define LCD_F_CSSEL0_CSS17                       ((uint32_t)0x00020000)          /*!< L17 Com Seg select */
#define LCD_F_CSSEL0_CSS18_OFS                   (18)                            /*!< LCDCSS18 Bit Offset */
#define LCD_F_CSSEL0_CSS18                       ((uint32_t)0x00040000)          /*!< L18 Com Seg select */
#define LCD_F_CSSEL0_CSS19_OFS                   (19)                            /*!< LCDCSS19 Bit Offset */
#define LCD_F_CSSEL0_CSS19                       ((uint32_t)0x00080000)          /*!< L19 Com Seg select */
#define LCD_F_CSSEL0_CSS20_OFS                   (20)                            /*!< LCDCSS20 Bit Offset */
#define LCD_F_CSSEL0_CSS20                       ((uint32_t)0x00100000)          /*!< L20 Com Seg select */
#define LCD_F_CSSEL0_CSS21_OFS                   (21)                            /*!< LCDCSS21 Bit Offset */
#define LCD_F_CSSEL0_CSS21                       ((uint32_t)0x00200000)          /*!< L21 Com Seg select */
#define LCD_F_CSSEL0_CSS22_OFS                   (22)                            /*!< LCDCSS22 Bit Offset */
#define LCD_F_CSSEL0_CSS22                       ((uint32_t)0x00400000)          /*!< L22 Com Seg select */
#define LCD_F_CSSEL0_CSS23_OFS                   (23)                            /*!< LCDCSS23 Bit Offset */
#define LCD_F_CSSEL0_CSS23                       ((uint32_t)0x00800000)          /*!< L23 Com Seg select */
#define LCD_F_CSSEL0_CSS24_OFS                   (24)                            /*!< LCDCSS24 Bit Offset */
#define LCD_F_CSSEL0_CSS24                       ((uint32_t)0x01000000)          /*!< L24 Com Seg select */
#define LCD_F_CSSEL0_CSS25_OFS                   (25)                            /*!< LCDCSS25 Bit Offset */
#define LCD_F_CSSEL0_CSS25                       ((uint32_t)0x02000000)          /*!< L25 Com Seg select */
#define LCD_F_CSSEL0_CSS26_OFS                   (26)                            /*!< LCDCSS26 Bit Offset */
#define LCD_F_CSSEL0_CSS26                       ((uint32_t)0x04000000)          /*!< L26 Com Seg select */
#define LCD_F_CSSEL0_CSS27_OFS                   (27)                            /*!< LCDCSS27 Bit Offset */
#define LCD_F_CSSEL0_CSS27                       ((uint32_t)0x08000000)          /*!< L27 Com Seg select */
#define LCD_F_CSSEL0_CSS28_OFS                   (28)                            /*!< LCDCSS28 Bit Offset */
#define LCD_F_CSSEL0_CSS28                       ((uint32_t)0x10000000)          /*!< L28 Com Seg select */
#define LCD_F_CSSEL0_CSS29_OFS                   (29)                            /*!< LCDCSS29 Bit Offset */
#define LCD_F_CSSEL0_CSS29                       ((uint32_t)0x20000000)          /*!< L29 Com Seg select */
#define LCD_F_CSSEL0_CSS30_OFS                   (30)                            /*!< LCDCSS30 Bit Offset */
#define LCD_F_CSSEL0_CSS30                       ((uint32_t)0x40000000)          /*!< L30 Com Seg select */
#define LCD_F_CSSEL0_CSS31_OFS                   (31)                            /*!< LCDCSS31 Bit Offset */
#define LCD_F_CSSEL0_CSS31                       ((uint32_t)0x80000000)          /*!< L31 Com Seg select */
#define LCD_F_CSSEL1_CSS32_OFS                   ( 0)                            /*!< LCDCSS32 Bit Offset */
#define LCD_F_CSSEL1_CSS32                       ((uint32_t)0x00000001)          /*!< L32 Com Seg select */
#define LCD_F_CSSEL1_CSS33_OFS                   ( 1)                            /*!< LCDCSS33 Bit Offset */
#define LCD_F_CSSEL1_CSS33                       ((uint32_t)0x00000002)          /*!< L33 Com Seg select */
#define LCD_F_CSSEL1_CSS34_OFS                   ( 2)                            /*!< LCDCSS34 Bit Offset */
#define LCD_F_CSSEL1_CSS34                       ((uint32_t)0x00000004)          /*!< L34 Com Seg select */
#define LCD_F_CSSEL1_CSS35_OFS                   ( 3)                            /*!< LCDCSS35 Bit Offset */
#define LCD_F_CSSEL1_CSS35                       ((uint32_t)0x00000008)          /*!< L35 Com Seg select */
#define LCD_F_CSSEL1_CSS36_OFS                   ( 4)                            /*!< LCDCSS36 Bit Offset */
#define LCD_F_CSSEL1_CSS36                       ((uint32_t)0x00000010)          /*!< L36 Com Seg select */
#define LCD_F_CSSEL1_CSS37_OFS                   ( 5)                            /*!< LCDCSS37 Bit Offset */
#define LCD_F_CSSEL1_CSS37                       ((uint32_t)0x00000020)          /*!< L37 Com Seg select */
#define LCD_F_CSSEL1_CSS38_OFS                   ( 6)                            /*!< LCDCSS38 Bit Offset */
#define LCD_F_CSSEL1_CSS38                       ((uint32_t)0x00000040)          /*!< L38 Com Seg select */
#define LCD_F_CSSEL1_CSS39_OFS                   ( 7)                            /*!< LCDCSS39 Bit Offset */
#define LCD_F_CSSEL1_CSS39                       ((uint32_t)0x00000080)          /*!< L39 Com Seg select */
#define LCD_F_CSSEL1_CSS40_OFS                   ( 8)                            /*!< LCDCSS40 Bit Offset */
#define LCD_F_CSSEL1_CSS40                       ((uint32_t)0x00000100)          /*!< L40 Com Seg select */
#define LCD_F_CSSEL1_CSS41_OFS                   ( 9)                            /*!< LCDCSS41 Bit Offset */
#define LCD_F_CSSEL1_CSS41                       ((uint32_t)0x00000200)          /*!< L41 Com Seg select */
#define LCD_F_CSSEL1_CSS42_OFS                   (10)                            /*!< LCDCSS42 Bit Offset */
#define LCD_F_CSSEL1_CSS42                       ((uint32_t)0x00000400)          /*!< L42 Com Seg select */
#define LCD_F_CSSEL1_CSS43_OFS                   (11)                            /*!< LCDCSS43 Bit Offset */
#define LCD_F_CSSEL1_CSS43                       ((uint32_t)0x00000800)          /*!< L43 Com Seg select */
#define LCD_F_CSSEL1_CSS44_OFS                   (12)                            /*!< LCDCSS44 Bit Offset */
#define LCD_F_CSSEL1_CSS44                       ((uint32_t)0x00001000)          /*!< L44 Com Seg select */
#define LCD_F_CSSEL1_CSS45_OFS                   (13)                            /*!< LCDCSS45 Bit Offset */
#define LCD_F_CSSEL1_CSS45                       ((uint32_t)0x00002000)          /*!< L45 Com Seg select */
#define LCD_F_CSSEL1_CSS46_OFS                   (14)                            /*!< LCDCSS46 Bit Offset */
#define LCD_F_CSSEL1_CSS46                       ((uint32_t)0x00004000)          /*!< L46 Com Seg select */
#define LCD_F_CSSEL1_CSS47_OFS                   (15)                            /*!< LCDCSS47 Bit Offset */
#define LCD_F_CSSEL1_CSS47                       ((uint32_t)0x00008000)          /*!< L47 Com Seg select */
#define LCD_F_CSSEL1_CSS48_OFS                   (16)                            /*!< LCDCSS48 Bit Offset */
#define LCD_F_CSSEL1_CSS48                       ((uint32_t)0x00010000)          /*!< L48 Com Seg select */
#define LCD_F_CSSEL1_CSS49_OFS                   (17)                            /*!< LCDCSS49 Bit Offset */
#define LCD_F_CSSEL1_CSS49                       ((uint32_t)0x00020000)          /*!< L49 Com Seg select */
#define LCD_F_CSSEL1_CSS50_OFS                   (18)                            /*!< LCDCSS50 Bit Offset */
#define LCD_F_CSSEL1_CSS50                       ((uint32_t)0x00040000)          /*!< L50 Com Seg select */
#define LCD_F_CSSEL1_CSS51_OFS                   (19)                            /*!< LCDCSS51 Bit Offset */
#define LCD_F_CSSEL1_CSS51                       ((uint32_t)0x00080000)          /*!< L51 Com Seg select */
#define LCD_F_CSSEL1_CSS52_OFS                   (20)                            /*!< LCDCSS52 Bit Offset */
#define LCD_F_CSSEL1_CSS52                       ((uint32_t)0x00100000)          /*!< L52 Com Seg select */
#define LCD_F_CSSEL1_CSS53_OFS                   (21)                            /*!< LCDCSS53 Bit Offset */
#define LCD_F_CSSEL1_CSS53                       ((uint32_t)0x00200000)          /*!< L53 Com Seg select */
#define LCD_F_CSSEL1_CSS54_OFS                   (22)                            /*!< LCDCSS54 Bit Offset */
#define LCD_F_CSSEL1_CSS54                       ((uint32_t)0x00400000)          /*!< L54 Com Seg select */
#define LCD_F_CSSEL1_CSS55_OFS                   (23)                            /*!< LCDCSS55 Bit Offset */
#define LCD_F_CSSEL1_CSS55                       ((uint32_t)0x00800000)          /*!< L55 Com Seg select */
#define LCD_F_CSSEL1_CSS56_OFS                   (24)                            /*!< LCDCSS56 Bit Offset */
#define LCD_F_CSSEL1_CSS56                       ((uint32_t)0x01000000)          /*!< L56 Com Seg select */
#define LCD_F_CSSEL1_CSS57_OFS                   (25)                            /*!< LCDCSS57 Bit Offset */
#define LCD_F_CSSEL1_CSS57                       ((uint32_t)0x02000000)          /*!< L57 Com Seg select */
#define LCD_F_CSSEL1_CSS58_OFS                   (26)                            /*!< LCDCSS58 Bit Offset */
#define LCD_F_CSSEL1_CSS58                       ((uint32_t)0x04000000)          /*!< L58 Com Seg select */
#define LCD_F_CSSEL1_CSS59_OFS                   (27)                            /*!< LCDCSS59 Bit Offset */
#define LCD_F_CSSEL1_CSS59                       ((uint32_t)0x08000000)          /*!< L59 Com Seg select */
#define LCD_F_CSSEL1_CSS60_OFS                   (28)                            /*!< LCDCSS60 Bit Offset */
#define LCD_F_CSSEL1_CSS60                       ((uint32_t)0x10000000)          /*!< L60 Com Seg select */
#define LCD_F_CSSEL1_CSS61_OFS                   (29)                            /*!< LCDCSS61 Bit Offset */
#define LCD_F_CSSEL1_CSS61                       ((uint32_t)0x20000000)          /*!< L61 Com Seg select */
#define LCD_F_CSSEL1_CSS62_OFS                   (30)                            /*!< LCDCSS62 Bit Offset */
#define LCD_F_CSSEL1_CSS62                       ((uint32_t)0x40000000)          /*!< L62 Com Seg select */
#define LCD_F_CSSEL1_CSS63_OFS                   (31)                            /*!< LCDCSS63 Bit Offset */
#define LCD_F_CSSEL1_CSS63                       ((uint32_t)0x80000000)          /*!< L63 Com Seg select */
#define LCD_F_ANMCTL_ANMEN_OFS                   ( 0)                            /*!< LCDANMEN Bit Offset */
#define LCD_F_ANMCTL_ANMEN                       ((uint32_t)0x00000001)          /*!< Enable Animation */
#define LCD_F_ANMCTL_ANMSTP_OFS                  ( 1)                            /*!< LCDANMSTP Bit Offset */
#define LCD_F_ANMCTL_ANMSTP_MASK                 ((uint32_t)0x0000000E)          /*!< LCDANMSTP Bit Mask */
#define LCD_F_ANMCTL_ANMSTP0                     ((uint32_t)0x00000002)          /*!< ANMSTP Bit 0 */
#define LCD_F_ANMCTL_ANMSTP1                     ((uint32_t)0x00000004)          /*!< ANMSTP Bit 1 */
#define LCD_F_ANMCTL_ANMSTP2                     ((uint32_t)0x00000008)          /*!< ANMSTP Bit 2 */
#define LCD_F_ANMCTL_ANMSTP_0                    ((uint32_t)0x00000000)          /*!< T0 */
#define LCD_F_ANMCTL_ANMSTP_1                    ((uint32_t)0x00000002)          /*!< T0 to T1 */
#define LCD_F_ANMCTL_ANMSTP_2                    ((uint32_t)0x00000004)          /*!< T0 to T2 */
#define LCD_F_ANMCTL_ANMSTP_3                    ((uint32_t)0x00000006)          /*!< T0 to T3 */
#define LCD_F_ANMCTL_ANMSTP_4                    ((uint32_t)0x00000008)          /*!< T0 to T4 */
#define LCD_F_ANMCTL_ANMSTP_5                    ((uint32_t)0x0000000A)          /*!< T0 to T5 */
#define LCD_F_ANMCTL_ANMSTP_6                    ((uint32_t)0x0000000C)          /*!< T0 to T6 */
#define LCD_F_ANMCTL_ANMSTP_7                    ((uint32_t)0x0000000E)          /*!< T0 to T7 */
#define LCD_F_ANMCTL_ANMCLR_OFS                  ( 7)                            /*!< LCDANMCLR Bit Offset */
#define LCD_F_ANMCTL_ANMCLR                      ((uint32_t)0x00000080)          /*!< Clear Animation Memory */
#define LCD_F_ANMCTL_ANMPRE_OFS                  (16)                            /*!< LCDANMPREx Bit Offset */
#define LCD_F_ANMCTL_ANMPRE_MASK                 ((uint32_t)0x00070000)          /*!< LCDANMPREx Bit Mask */
#define LCD_F_ANMCTL_ANMPRE0                     ((uint32_t)0x00010000)          /*!< ANMPRE Bit 0 */
#define LCD_F_ANMCTL_ANMPRE1                     ((uint32_t)0x00020000)          /*!< ANMPRE Bit 1 */
#define LCD_F_ANMCTL_ANMPRE2                     ((uint32_t)0x00040000)          /*!< ANMPRE Bit 2 */
#define LCD_F_ANMCTL_ANMPRE_0                    ((uint32_t)0x00000000)          /*!< Divide by 512 */
#define LCD_F_ANMCTL_ANMPRE_1                    ((uint32_t)0x00010000)          /*!< Divide by 1024 */
#define LCD_F_ANMCTL_ANMPRE_2                    ((uint32_t)0x00020000)          /*!< Divide by 2048 */
#define LCD_F_ANMCTL_ANMPRE_3                    ((uint32_t)0x00030000)          /*!< Divide by 4096 */
#define LCD_F_ANMCTL_ANMPRE_4                    ((uint32_t)0x00040000)          /*!< Divide by 8162 */
#define LCD_F_ANMCTL_ANMPRE_5                    ((uint32_t)0x00050000)          /*!< Divide by 16384 */
#define LCD_F_ANMCTL_ANMPRE_6                    ((uint32_t)0x00060000)          /*!< Divide by 32768 */
#define LCD_F_ANMCTL_ANMPRE_7                    ((uint32_t)0x00070000)          /*!< Divide by 65536 */
#define LCD_F_ANMCTL_ANMDIV_OFS                  (19)                            /*!< LCDANMDIVx Bit Offset */
#define LCD_F_ANMCTL_ANMDIV_MASK                 ((uint32_t)0x00380000)          /*!< LCDANMDIVx Bit Mask */
#define LCD_F_ANMCTL_ANMDIV0                     ((uint32_t)0x00080000)          /*!< ANMDIV Bit 0 */
#define LCD_F_ANMCTL_ANMDIV1                     ((uint32_t)0x00100000)          /*!< ANMDIV Bit 1 */
#define LCD_F_ANMCTL_ANMDIV2                     ((uint32_t)0x00200000)          /*!< ANMDIV Bit 2 */
#define LCD_F_ANMCTL_ANMDIV_0                    ((uint32_t)0x00000000)          /*!< Divide by 1 */
#define LCD_F_ANMCTL_ANMDIV_1                    ((uint32_t)0x00080000)          /*!< Divide by 2 */
#define LCD_F_ANMCTL_ANMDIV_2                    ((uint32_t)0x00100000)          /*!< Divide by 3 */
#define LCD_F_ANMCTL_ANMDIV_3                    ((uint32_t)0x00180000)          /*!< Divide by 4 */
#define LCD_F_ANMCTL_ANMDIV_4                    ((uint32_t)0x00200000)          /*!< Divide by 5 */
#define LCD_F_ANMCTL_ANMDIV_5                    ((uint32_t)0x00280000)          /*!< Divide by 6 */
#define LCD_F_ANMCTL_ANMDIV_6                    ((uint32_t)0x00300000)          /*!< Divide by 7 */
#define LCD_F_ANMCTL_ANMDIV_7                    ((uint32_t)0x00380000)          /*!< Divide by 8 */
#define LCD_F_IE_BLKOFFIE_OFS                    ( 1)                            /*!< LCDBLKOFFIE Bit Offset */
#define LCD_F_IE_BLKOFFIE                        ((uint32_t)0x00000002)          /*!< LCD Blink, segments off interrupt enable */
#define LCD_F_IE_BLKONIE_OFS                     ( 2)                            /*!< LCDBLKONIE Bit Offset */
#define LCD_F_IE_BLKONIE                         ((uint32_t)0x00000004)          /*!< LCD Blink, segments on interrupt enable */
#define LCD_F_IE_FRMIE_OFS                       ( 3)                            /*!< LCDFRMIE Bit Offset */
#define LCD_F_IE_FRMIE                           ((uint32_t)0x00000008)          /*!< LCD Frame interrupt enable */
#define LCD_F_IE_ANMSTPIE_OFS                    ( 8)                            /*!< LCDANMSTPIE Bit Offset */
#define LCD_F_IE_ANMSTPIE                        ((uint32_t)0x00000100)          /*!< LCD Animation step interrupt enable */
#define LCD_F_IE_ANMLOOPIE_OFS                   ( 9)                            /*!< LCDANMLOOPIE Bit Offset */
#define LCD_F_IE_ANMLOOPIE                       ((uint32_t)0x00000200)          /*!< LCD Animation loop interrupt enable */
#define LCD_F_IFG_BLKOFFIFG_OFS                  ( 1)                            /*!< LCDBLKOFFIFG Bit Offset */
#define LCD_F_IFG_BLKOFFIFG                      ((uint32_t)0x00000002)          /*!< LCD Blink, segments off interrupt flag */
#define LCD_F_IFG_BLKONIFG_OFS                   ( 2)                            /*!< LCDBLKONIFG Bit Offset */
#define LCD_F_IFG_BLKONIFG                       ((uint32_t)0x00000004)          /*!< LCD Blink, segments on interrupt flag */
#define LCD_F_IFG_FRMIFG_OFS                     ( 3)                            /*!< LCDFRMIFG Bit Offset */
#define LCD_F_IFG_FRMIFG                         ((uint32_t)0x00000008)          /*!< LCD Frame interrupt flag */
#define LCD_F_IFG_ANMSTPIFG_OFS                  ( 8)                            /*!< LCDANMSTPIFG Bit Offset */
#define LCD_F_IFG_ANMSTPIFG                      ((uint32_t)0x00000100)          /*!< LCD Animation step interrupt flag */
#define LCD_F_IFG_ANMLOOPIFG_OFS                 ( 9)                            /*!< LCDANMLOOPIFG Bit Offset */
#define LCD_F_IFG_ANMLOOPIFG                     ((uint32_t)0x00000200)          /*!< LCD Animation loop interrupt flag */
#define LCD_F_SETIFG_SETLCDBLKOFFIFG_OFS         ( 1)                            /*!< SETLCDBLKOFFIFG Bit Offset */
#define LCD_F_SETIFG_SETLCDBLKOFFIFG             ((uint32_t)0x00000002)          /*!< Sets LCDBLKOFFIFG */
#define LCD_F_SETIFG_SETLCDBLKONIFG_OFS          ( 2)                            /*!< SETLCDBLKONIFG Bit Offset */
#define LCD_F_SETIFG_SETLCDBLKONIFG              ((uint32_t)0x00000004)          /*!< Sets LCDBLKONIFG */
#define LCD_F_SETIFG_SETLCDFRMIFG_OFS            ( 3)                            /*!< SETLCDFRMIFG Bit Offset */
#define LCD_F_SETIFG_SETLCDFRMIFG                ((uint32_t)0x00000008)          /*!< Sets LCDFRMIFG */
#define LCD_F_SETIFG_SETLCDANMSTPIFG_OFS         ( 8)                            /*!< SETLCDANMSTPIFG Bit Offset */
#define LCD_F_SETIFG_SETLCDANMSTPIFG             ((uint32_t)0x00000100)          /*!< Sets LCDANMSTPIFG */
#define LCD_F_SETIFG_SETLCDANMLOOPIFG_OFS        ( 9)                            /*!< SETLCDANMLOOPIFG Bit Offset */
#define LCD_F_SETIFG_SETLCDANMLOOPIFG            ((uint32_t)0x00000200)          /*!< Sets LCDANMLOOPIFG */
#define LCD_F_CLRIFG_CLRLCDBLKOFFIFG_OFS         ( 1)                            /*!< CLRLCDBLKOFFIFG Bit Offset */
#define LCD_F_CLRIFG_CLRLCDBLKOFFIFG             ((uint32_t)0x00000002)          /*!< Clears LCDBLKOFFIFG */
#define LCD_F_CLRIFG_CLRLCDBLKONIFG_OFS          ( 2)                            /*!< CLRLCDBLKONIFG Bit Offset */
#define LCD_F_CLRIFG_CLRLCDBLKONIFG              ((uint32_t)0x00000004)          /*!< Clears LCDBLKONIFG */
#define LCD_F_CLRIFG_CLRLCDFRMIFG_OFS            ( 3)                            /*!< CLRLCDFRMIFG Bit Offset */
#define LCD_F_CLRIFG_CLRLCDFRMIFG                ((uint32_t)0x00000008)          /*!< Clears LCDFRMIFG */
#define LCD_F_CLRIFG_CLRLCDANMSTPIFG_OFS         ( 8)                            /*!< CLRLCDANMSTPIFG Bit Offset */
#define LCD_F_CLRIFG_CLRLCDANMSTPIFG             ((uint32_t)0x00000100)          /*!< Clears LCDANMSTPIFG */
#define LCD_F_CLRIFG_CLRLCDANMLOOPIFG_OFS        ( 9)                            /*!< CLRLCDANMLOOPIFG Bit Offset */
#define LCD_F_CLRIFG_CLRLCDANMLOOPIFG            ((uint32_t)0x00000200)          /*!< Clears LCDANMLOOPIFG */
#define SYSCTL_A_REBOOT_CTL_REBOOT_OFS           ( 0)                            /*!< REBOOT Bit Offset */
#define SYSCTL_A_REBOOT_CTL_REBOOT               ((uint32_t)0x00000001)          /*!< Write 1 initiates a Reboot of the device */
#define SYSCTL_A_REBOOT_CTL_WKEY_OFS             ( 8)                            /*!< WKEY Bit Offset */
#define SYSCTL_A_REBOOT_CTL_WKEY_MASK            ((uint32_t)0x0000FF00)          /*!< WKEY Bit Mask */
#define SYSCTL_A_NMI_CTLSTAT_CS_SRC_OFS          ( 0)                            /*!< CS_SRC Bit Offset */
#define SYSCTL_A_NMI_CTLSTAT_CS_SRC              ((uint32_t)0x00000001)          /*!< CS interrupt as a source of NMI */
#define SYSCTL_A_NMI_CTLSTAT_PSS_SRC_OFS         ( 1)                            /*!< PSS_SRC Bit Offset */
#define SYSCTL_A_NMI_CTLSTAT_PSS_SRC             ((uint32_t)0x00000002)          /*!< PSS interrupt as a source of NMI */
#define SYSCTL_A_NMI_CTLSTAT_PCM_SRC_OFS         ( 2)                            /*!< PCM_SRC Bit Offset */
#define SYSCTL_A_NMI_CTLSTAT_PCM_SRC             ((uint32_t)0x00000004)          /*!< PCM interrupt as a source of NMI */
#define SYSCTL_A_NMI_CTLSTAT_PIN_SRC_OFS         ( 3)                            /*!< PIN_SRC Bit Offset */
#define SYSCTL_A_NMI_CTLSTAT_PIN_SRC             ((uint32_t)0x00000008)          
#define SYSCTL_A_NMI_CTLSTAT_CS_FLG_OFS          (16)                            /*!< CS_FLG Bit Offset */
#define SYSCTL_A_NMI_CTLSTAT_CS_FLG              ((uint32_t)0x00010000)          /*!< CS interrupt was the source of NMI */
#define SYSCTL_A_NMI_CTLSTAT_PSS_FLG_OFS         (17)                            /*!< PSS_FLG Bit Offset */
#define SYSCTL_A_NMI_CTLSTAT_PSS_FLG             ((uint32_t)0x00020000)          /*!< PSS interrupt was the source of NMI */
#define SYSCTL_A_NMI_CTLSTAT_PCM_FLG_OFS         (18)                            /*!< PCM_FLG Bit Offset */
#define SYSCTL_A_NMI_CTLSTAT_PCM_FLG             ((uint32_t)0x00040000)          /*!< PCM interrupt was the source of NMI */
#define SYSCTL_A_NMI_CTLSTAT_PIN_FLG_OFS         (19)                            /*!< PIN_FLG Bit Offset */
